(lldb) target create "./a.out"
Current executable set to '/Users/bagjeonghun/git/playground/not_language_specific/book/csapp/a.out' (x86_64).
(lldb) breakpoint set --name main
Breakpoint 1: where = a.out`main, address = 0x0000000100003f70
(lldb) run
Process 74982 launched: '/Users/bagjeonghun/git/playground/not_language_specific/book/csapp/a.out' (x86_64)
(lldb) n
(lldb) n
(lldb) 
(lldb) 
(lldb) 
(lldb) 
(lldb) 
(lldb) memory read $rsp
0x3040ff2b0: 1e 00 bd cf 2f 33 f6 d4 ff ff ff ff ff ff ff ff  ..../3..........
0x3040ff2c0: 40 2c 49 08 02 00 00 00 70 3f 01 00 00 00 00 00  @,I.....p?......
(lldb) register read
General Purpose Registers:
       rax = 0x0000000108491510
       rbx = 0x0000000108491510
       rcx = 0x00000003040ff738
       rdx = 0x00000003040ff5a0
       rdi = 0x0000000000000001
       rsi = 0x00000003040ff590
       rbp = 0x00000003040ff2d0
       rsp = 0x00000003040ff2b0
        r8 = 0x00000003040fee08
        r9 = 0x000000020008b150  dyld`lsl::AllocationMetadata::granules
       r10 = 0x0000000108491100
       r11 = 0x0000000108493000
       r12 = 0x0000000108492c60
       r13 = 0x00000003040ff4e0
       r14 = 0x0000000108492c40
       r15 = 0x0000000100003f70  a.out`main
       rip = 0x0000000100003f94  a.out`main + 36
    rflags = 0x0000000000000202
        cs = 0x000000000000002b
        fs = 0x0000000000000000
        gs = 0x0000000000000000

(lldb) n
(lldb) 
(lldb) 
(lldb) 
(lldb) register read
General Purpose Registers:
       rax = 0x0000000108490001
       rbx = 0x0000000108491510
       rcx = 0x00000003040ff738
       rdx = 0xffffffffffffffff
       rdi = 0x0000000000000001
       rsi = 0x0000000000000002
       rbp = 0x00000003040ff2d0
       rsp = 0x00000003040ff2b0
        r8 = 0x00000003040fee08
        r9 = 0x000000020008b150  dyld`lsl::AllocationMetadata::granules
       r10 = 0x0000000108491100
       r11 = 0x0000000108493000
       r12 = 0x0000000108492c60
       r13 = 0x00000003040ff4e0
       r14 = 0x0000000108492c40
       r15 = 0x0000000100003f70  a.out`main
       rip = 0x0000000100003fa2  a.out`main + 50
    rflags = 0x0000000000000202
        cs = 0x000000000000002b
        fs = 0x0000000000000000
        gs = 0x0000000000000000

(lldb) register -a read
invalid command 'register -a'.
(lldb) register read -a
General Purpose Registers:
       rax = 0x0000000108490001
       rbx = 0x0000000108491510
       rcx = 0x00000003040ff738
       rdx = 0xffffffffffffffff
       rdi = 0x0000000000000001
       rsi = 0x0000000000000002
       rbp = 0x00000003040ff2d0
       rsp = 0x00000003040ff2b0
        r8 = 0x00000003040fee08
        r9 = 0x000000020008b150  dyld`lsl::AllocationMetadata::granules
       r10 = 0x0000000108491100
       r11 = 0x0000000108493000
       r12 = 0x0000000108492c60
       r13 = 0x00000003040ff4e0
       r14 = 0x0000000108492c40
       r15 = 0x0000000100003f70  a.out`main
       rip = 0x0000000100003fa2  a.out`main + 50
    rflags = 0x0000000000000202
        cs = 0x000000000000002b
        fs = 0x0000000000000000
        gs = 0x0000000000000000
       eax = 0x08490001
       ebx = 0x08491510
       ecx = 0x040ff738
       edx = 0xffffffff
       edi = 0x00000001
       esi = 0x00000002
       ebp = 0x040ff2d0
       esp = 0x040ff2b0
       r8d = 0x040fee08
       r9d = 0x0008b150
      r10d = 0x08491100
      r11d = 0x08493000
      r12d = 0x08492c60
      r13d = 0x040ff4e0
      r14d = 0x08492c40
      r15d = 0x00003f70
        ax = 0x0001
        bx = 0x1510
        cx = 0xf738
        dx = 0xffff
        di = 0x0001
        si = 0x0002
        bp = 0xf2d0
        sp = 0xf2b0
       r8w = 0xee08
       r9w = 0xb150
      r10w = 0x1100
      r11w = 0x3000
      r12w = 0x2c60
      r13w = 0xf4e0
      r14w = 0x2c40
      r15w = 0x3f70
        ah = 0x00
        bh = 0x15
        ch = 0xf7
        dh = 0xff
        al = 0x01
        bl = 0x10
        cl = 0x38
        dl = 0xff
       dil = 0x01
       sil = 0x02
       bpl = 0xd0
       spl = 0xb0
       r8l = 0x08
       r9l = 0x50
      r10l = 0x00
      r11l = 0x00
      r12l = 0x60
      r13l = 0xe0
      r14l = 0x40
      r15l = 0x70

Floating Point Registers:
     fctrl = 0x037f
     fstat = 0x0000
      ftag = 0x0000
       fop = 0x0000
     fioff = 0x00000000
     fiseg = 0x0000
     fooff = 0x00000000
     foseg = 0x0000
     mxcsr = 0x00001f80
  mxcsrmask = 0x0000ffff
     stmm0 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0xc0 0xff 0xff}
     stmm1 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0xc0 0xff 0xff}
     stmm2 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0xc0 0xff 0xff}
     stmm3 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0xc0 0xff 0xff}
     stmm4 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0xc0 0xff 0xff}
     stmm5 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0xc0 0xff 0xff}
     stmm6 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0xc0 0xff 0xff}
     stmm7 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0xc0 0xff 0xff}
      xmm0 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00}
      xmm1 = {0x00 0x12 0x49 0x08 0x01 0x00 0x00 0x00 0x00 0x12 0x49 0x08 0x01 0x00 0x00 0x00}
      xmm2 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00}
      xmm3 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0xaa 0xaa 0xaa 0xaa}
      xmm4 = {0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00}
      xmm5 = {0x02 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00}
      xmm6 = {0x88 0x23 0x01 0x0d 0xa4 0x81 0xf5 0x08 0xc2 0xf1 0x40 0x9b 0x30 0x09 0x6b 0x54}
      xmm7 = {0x16 0x1c 0xd5 0x4e 0xb5 0x30 0x5e 0x5b 0x50 0x2d 0x06 0x2e 0x70 0x57 0x0c 0x68}
      xmm8 = {0xd2 0xb2 0xc5 0x5c 0x96 0xc0 0x28 0x15 0x06 0x81 0x6c 0xb0 0x8c 0xdd 0x7d 0xf3}
      xmm9 = {0x0d 0xaf 0x13 0x57 0x33 0x02 0x78 0x90 0x94 0x89 0xe2 0x65 0x42 0x9e 0x46 0x8e}
     xmm10 = {0xa2 0x7e 0xee 0xd7 0x23 0x39 0xf0 0x0e 0xa0 0x94 0x7c 0x2b 0xb5 0xc9 0xbd 0x38}
     xmm11 = {0x84 0x1e 0xaf 0xc2 0x6a 0x4a 0x59 0x8e 0xd4 0x33 0xa9 0xec 0x1a 0x1d 0x55 0xe6}
     xmm12 = {0x00 0xda 0x12 0x59 0x23 0xe3 0xe2 0x57 0x83 0x77 0x9e 0x7c 0x36 0xbe 0x23 0x44}
     xmm13 = {0x2e 0x38 0xb4 0xc7 0x44 0x72 0xed 0x49 0x90 0x41 0x44 0xa5 0x8a 0x5c 0x11 0x43}
     xmm14 = {0x7e 0x90 0x90 0x43 0x5d 0x73 0x72 0x14 0xde 0x04 0xec 0x68 0xe8 0xba 0xcf 0x2c}
     xmm15 = {0xca 0x45 0x23 0xe6 0xa1 0x7d 0x34 0x54 0x71 0x53 0xbf 0xd5 0x6e 0x5e 0x94 0x36}

Exception State Registers:
    trapno = 0x00000001
       err = 0x00000000
  faultvaddr = 0x0000000000000000

(lldb) session save lldb_x64.session
